Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.Visibility Property
 The visibility of the reference model in the model view.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReferenceModel.VisibilityEnum Visibility { get; set; }
Public Property Visibility As ReferenceModel.VisibilityEnum
	Get
	Set
Property Value
Type: ReferenceModel.VisibilityEnum
See Also
Reference
ReferenceModel Class
Tekla.Structures.Model Namespace